Revit 2026 API

# IDirectContext3DServerUsesHandles Method

---

Tests whether this server uses DirectContext3D handle elements.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
bool UsesHandles()
```
```vb
Function UsesHandles As Boolean
```
```cpp
bool UsesHandles()
```
```fsharp
abstract UsesHandles : unit -> bool
```

#### Return Value

Boolean True if the server needs to use DirectContext3D handle elements, false otherwise.

In the current release servers that use handle elements can only work with internal addins.

Third-party implementers should return 'false'.

#### Reference

IDirectContext3DServer Interface

Autodesk.Revit.DB.DirectContext3D Namespace